Revit 2024 API
DuctFittingAndAccessoryPressureDropData Properties
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Properties
Name | Description
CalculationType
 The calculation type, a bitmask of FittingAndAccessoryCalculationType.
IsCurrentEntityValid
 True if the current settings stored in the entity is valid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace